import { Card, Grid, CardContent, Typography, Tab, Tabs } from '@material-ui/core';

import React, { useState } from 'react';
import ChartView from './ChartView';
import GridView from './GridView';

import AppsOutlinedIcon from '@material-ui/icons/AppsOutlined';
import ReorderOutlinedIcon from '@material-ui/icons/ReorderOutlined';
import AccountTreeIcon from '@material-ui/icons/AccountTree';
import MakeTree from './MakeTree';
import { useTranslation } from 'react-i18next';
import index from './OrgChart/Index';

const data = [
	{
		name: 'رئاسة الجمهوريّة',
		children: [
			{
				name: 'الأمانة العامة لرئاسة الجمهورية',
			},
		],
	},
	{
		name: 'المجلس النيابي',
		children: [
			{
				name: 'الأمانة العامة لرئاسة المجلس النيابي',
			},
		],
	},
	{
		name: 'رئاسة الحكومة',
		children: [
			{
				name: 'الأمانة العامة لرئاسة الحكومة',
			},
			{
				name: 'مجلس الجنوب',
			},
			{
				name: 'مجلس الإنماء والإعمار',
				children: [
					{
						name: 'صندوق التنمية الإقتصادية والاجتماعيّة',
					},
				],
			},
			{
				name: 'المجلس الوطني للبحوث العلميّة',
				children: [
					{
						name: 'المركز الوطني للبحوث الجيوفيزيائيّة',
					},
					{
						name: 'الهيئة العليا للطاقة الذريّة',
					},
					{
						name: 'المركز الوطني لعلوم البحار',
					},
					{
						name: 'المركز الوطني للإستشعار عن بعد',
					},
				],
			},
			{
				name: 'المجلس الوطني للسلامة المروريّة',
			},
			{
				name: 'المجلس الإقتصادي والاجتماعي',
			},
			{
				name: 'المجلس الأعلى للخصخصة',
			},
			{
				name: 'المجلس الأعلى للدفاع',
			},
			{
				name: 'المؤسسة العامّة لتشجيع الاستثمارات',
			},
			{
				name: 'المؤسسة العامّة لترتيب منطقة الضاحية الجنوبيّة (أليسار)',
			},
			{
				name: 'مؤسسة المحفوظات الوطنيّة',
			},
			{
				name: 'المؤسسة العامّة للأسواق الاستهلاكيّة',
			},
			{
				name: 'الهيئة العليا للإغاثة',
			},
			{
				name: 'الهيئة الوطنية لشؤون المرأة اللبنانيّة',
			},
			{
				name: 'الهيئة العامّة للمنطقة الاقتصادية الخاصّة في طرابلس',
			},
			{
				name: 'الصندوق الوطني للمهجرين',
			},
			{
				name: 'الإحصاء المركزي',
			},
			{
				name: 'المديريّة العامّة لأمن الدولة',
			},
			{
				name: 'الإفتاء السني',
			},
			{
				name: 'الإفتاء الجعفري',
			},
			{
				name: 'المجلس الإسلامي الشيعي الأعلى',
			},
			{
				name: 'المجلس الإسلامي العلوي',
			},
			{
				name: 'المجلس المذهبي لطائفة الموحدين الدروز',
			},
			{
				name: 'مشيخة عقل الطائفة الدرزيّة',
			},
			{
				name: 'التفتيش المركزي',
				children: [
					{
						name: 'إدارة المناقصات',
					},
				],
			},
			{
				name: 'الهيئة العليا للتأديب',
			},
			{
				name: 'ديوان المحاسبة',
			},
			{
				name: 'مجلس الخدمة المدنيّة',
				children: [
					{
						name: 'المعهد الوطني للإدارة',
					},
					{
						name: 'إدارة الأبحاث والتوجيه',
					},
				],
			},
			{
				name: 'تعاونية موظفي الدولة - الادارة المركزية',
			},
		],
	},
	{
		name: 'وزارة العدل',
		children: [
			{
				name: 'المديرية العامة لوزارة العدل',
			},
			{
				name: 'مجلس شورى الدولة',
			},
			{
				name: 'مجلس القضاء الأعلى',
			},
		],
	},
	{
		name: 'المجلس الدستوري',
	},
	{
		name: 'وزارة الماليّة',
		children: [
			{
				name: 'مديرية الماليّة العامّة',
			},
			{
				name: 'مديرية الواردات',
			},
			{
				name: 'مديرية الضريبة على القيمة المضافة',
			},
			{
				name: 'مديرية الصرفيات',
			},
			{
				name: 'مديرية الخزينة',
			},
			{
				name: 'مديرية الدين العام',
			},
			{
				name: 'مديرية الموازنة',
			},
			{
				name: ' مديرية المحاسبة العامّة',
			},
			{
				name: 'المديرية العامّة للشؤون العقاريّة',
			},
			{
				name: 'المديرية العامّة لليانصيب الوطني',
			},
			{
				name: 'المديريّة العامّة للجمارك',
			},
			{
				name: 'معهد باسل فليحان الاقتصادي والمالي',
			},
			{
				name: 'المؤسسة الوطنيّة لضمان الودائع',
			},
			{
				name: 'إدارة حصر التبغ والتنباك اللبنانيّة',
			},
			{
				name: 'مصرف لبنان',
				children: [
					{
						name: 'هيئة الأسواق المالية',
					},
					{
						name: 'بورصة بيروت',
					},
					{
						name: 'كازينو لبنان',
					},
					{
						name: 'طيران الشرق الأوسط',
					},
					{
						name: 'شركة إنترا',
					},
				],
			},
		],
	},
	{
		name: 'وزارة الداخليّة والبلديات',
		children: [
			{
				name: 'وزارة الداخليّة والبلديات - المديرية الإداريّة المشتركة',
			},
			{
				name: ' المديرية العامّة للإدارات والمجالس المحليّة',
			},
			{
				name: 'المديريّة العامّة للشؤون السياسية واللاجئين',
			},
			{
				name: 'المديريّة العامّة للأحوال الشخصيّة',
			},
			{
				name: 'المديريّة العامّة للدفاع المدني',
			},
			{
				name: 'هيئة ادارة السير والآليات والمركبات',
			},
			{
				name: 'المديريّة العامّة لقوى الأمن الداخلي',
			},
			{
				name: 'المديريّة العامّة لقوى الأمن العام',
			},
			{
				name: 'المديريّة المركزيّة لمكافحة المخدرات',
			},
			{
				name: 'جهاز أمن المطار',
			},
			{
				name: 'الشركة المشغّلة للمعاينة الميكانيكيّة',
			},
			{
				name: 'الشركة المشغّلة لعدادات الوقوف (parkmeter)',
			},
			{
				name: 'المحافظات',
				children: [
					{
						name: 'محافظة جبل لبنان',
					},
					{
						name: 'محافظة بيروت',
					},
					{
						name: 'محافظة البقاع',
					},
					{
						name: 'محافظة الجنوب',
					},
					{
						name: 'محافظة الشمال',
					},
					{
						name: 'محافظة بعلبك - الهرمل',
					},
					{
						name: 'محافظة عكار',
					},
					{
						name: 'محافظة النبطية',
					},
				],
			},
		],
	},
	{
		name: 'وزارة الخارجيّة',
		children: [
			{
				name: 'وزارة الخارجيّة - الأمانة العامة',
			},
			{
				name: 'مديرية الشؤون السياسية والقنصلية',
			},
		],
	},
	{
		name: 'وزارة الأشغال العامّة والنقل',
		children: [
			{
				name: 'وزارة الأشغال العامّة والنقل - المديريّة الإداريّة المشتركة',
			},
			{
				name: 'المديريّة العامّة للنقل البري والبحري',
			},
			{
				name: 'المديريّة العامّة للطرق والمباني',
			},
			{
				name: 'المديريّة العامّة للطيران المدني',
			},
			{
				name: 'الشركة المشغّلة لمواقف السيّارات في مطار رفيق الحريري الدولي',
			},
			{
				name: 'المديريّة العامّة للتنظيم المدني',
			},
			{
				name: 'مصلحة سكك الحديد والنقل المشترك',
			},
			{
				name: 'إدارة واستثمار مرفأ بيروت',
			},
			{
				name: 'مصلحة استثمار مرفأ صور',
			},
			{
				name: 'مصلحة استثمار مرفأ صيدا',
			},
			{
				name: 'مصلحة استثمار مرفأ طرابلس',
			},
			{
				name: 'الشركة المشغّلة للسوق الحرّة (Duty Free)',
			},
		],
	},
	{
		name: 'وزارة الطاقة والمياه',
		children: [
			{
				name: 'المديريّة العامّة للموارد المائيّة والكهربائيّة',
			},
			{
				name: ' المديريّة العامّة للإستثمار',
			},
			{
				name: 'المديريّة العامّة للنفط',
			},
			{
				name: 'مؤسسة كهرباء لبنان',
			},
			{
				name: 'مؤسسة كهرباء زحلة',
			},
			{
				name: 'مؤسسة مياه بيروت وجبل لبنان',
			},
			{
				name: 'مؤسسة مياه لبنان الشمالي',
			},
			{
				name: 'مؤسسة مياه لبنان الجنوبي',
			},
			{
				name: 'مؤسسة مياه البقاع',
			},
			{
				name: 'المصلحة الوطنيّة لنهر الليطاني',
			},
			{
				name: 'هيئة إدارة قطاع البترول',
			},
		],
	},
	{
		name: ' وزارة التربيّة والتعليم العالي',
		children: [
			{
				name: 'المديريّة العامّة للتربية',
			},
			{
				name: 'مديرية التعليم الأساسي',
			},
			{
				name: 'مديرية التعليم الثانوي',
			},
			{
				name: 'المديريّة العامّة للتعليم العالي',
			},
			{
				name: 'المديريّة العامّة للتعليم المهني والتقني',
			},
			{
				name: 'الجامعة اللبنانيّة',
			},
			{
				name: 'المركز التربوي للبحوث والإنماء',
			},
		],
	},
	{
		name: 'وزارة الصحة',
		children: [
			{
				name: 'مديرية الصحّة العامّة',
			},
			{
				name: 'مديرية العناية الطبيّة',
			},
			{
				name: 'مديرية الوقاية الصحيّة',
			},
			{
				name: 'مديرية المختبر المركزي للصحة العامّة',
			},
			{
				name: 'المستشفيات الحكوميّة',
				children: [
					{
						name: 'مستشفى رفيق الحريري',
					},
					{
						name: 'مستشفى بعبدا الجامعي الحكومي',
					},
					{
						name: 'مستشفى بعلبك الحكومي',
					},
					{
						name: 'مستشفى بشري الحكومي',
					},
					{
						name: 'مستشفى بنت جبيل الحكومي',
					},
					{
						name: 'مستشفى ضهر الباشق الحكومي الجامعي',
					},
					{
						name: 'مستشفى الدكتور عبدالله الراسي الحكومي',
					},
					{
						name: 'مستشفى اهدن الحكومي',
					},
					{
						name: 'مستشفى فتوح كسروان الحكومي',
					},
					{
						name: 'مستشفى بيروت الحكومي - الكرنتينا',
					},
					{
						name: 'مستشفى حاصبيا الحكومي',
					},
					{
						name: '  مستشفى الهرمل الحكومي',
					},
					{
						name: 'مستشفى جزين الحكومي',
					},
					{
						name: 'مستشفى قانا',
					},
					{
						name: 'مستشفى قرطبا الحكومي',
					},
					{
						name: 'مستشفى مرجعيون الحكومي',
					},
					{
						name: 'مستشفى ميس الجبل الحكومي',
					},
					{
						name: 'مستشفى النبطية الحكومي',
					},
					{
						name: 'مستشفى اورانج ناسو الحكومي',
					},
					{
						name: 'مستشفى الرئيس الياس الهراوي الحكومي',
					},
					{
						name: 'مستشفى راشيا الحكومي',
					},
					{
						name: 'مستشفى صيدا الحكومي الجامعي',
					},
					{
						name: 'مستشفى سبلين الحكومي',
					},
					{
						name: 'مستشفى الشحار الغربي الحكومي',
					},
					{
						name: 'مستشفى سير الضنية الحكومي',
					},
					{
						name: 'مستشفى صور الحكومي',
					},
					{
						name: 'مستشفى تنورين الحكومي',
					},
					{
						name: 'مستشفى تبنين الحكومي',
					},
					{
						name: 'مستشفى طرابلس الحكومي',
					},
				],
			},
		],
	},
	{
		name: 'وزارة الصناعة',
		children: [
			{
				name: 'المديريّة العامّة لوزارة الصناعة',
			},
			{
				name: 'مؤسسة المقاييس والمواصفات',
			},
			{
				name: 'معهد البحوث الصناعيّة',
			},
		],
	},
	{
		name: 'وزارة الإتصالات',
		children: [
			{
				name: 'وزارة الإتصالات - المصلحة الإداريّة المشتركة',
			},
			{
				name: 'المديريّة العامّة للإستثمار والصيانة',
			},
			{
				name: 'المديريّة العامّة للإنشاء والتجهيز',
			},
			{
				name: 'المديريّة العامّة للبريد',
			},
			{
				name: 'هيئة أوجيرو',
			},
			{
				name: 'الهيئة المنظمة للإتصالات',
			},
			{
				name: 'شركة تاتش',
			},
			{
				name: 'شركة ألفا',
			},
		],
	},
	{
		name: 'وزارة الثقافة',
		children: [
			{
				name: 'المديريّة العامّة للثقافة',
			},
			{
				name: 'المديريّة العامّة للآثار',
			},
			{
				name: 'المعهد الوطني العالي للموسيقى (الكونسرفاتوار)',
			},
			{
				name: 'قصر الأونيسكو',
			},
			{
				name: 'المتحف الوطني',
			},
			{
				name: 'المكتبة الوطنيّة – الصنائع',
			},
			{
				name: 'المكتبة الوطنيّة – بعقلين',
			},
		],
	},
	{
		name: 'وزارة الزراعة',
		children: [
			{
				name: 'المديريّة العامّة لوزارة الزراعة',
			},
			{
				name: 'مديرية العامة للتعاونيات',
			},
			{
				name: 'مصلحة الأبحاث العلميّة الزراعيّة',
			},
			{
				name: 'المشروع الأخضر',
			},
		],
	},
	{
		name: 'وزارة السياحة',
		children: [
			{
				name: 'المديريّة العامّة للشؤون السياحيّة',
			},
			{
				name: 'شركة ماباس (الشركة المالكة لحق استثمار مغارة جعيتا)',
			},
		],
	},
	{
		name: 'وزارة الشؤون الاجتماعيّة',
		children: [
			{
				name: 'المديريّة العامّة للشؤون الاجتماعيّة',
			},
			{
				name: 'مديرية الخدمات',
			},
			{
				name: 'مديرية التنمية الاجتماعيّة',
			},
			{
				name: 'برنامج تأمين حقوق المعوقين',
			},
			{
				name: 'المجلس الأعلى للطفولة',
			},
			{
				name: 'المؤسسة العامّة للإسكان',
			},
			{
				name: 'اللجنة الوطنية لمحو الأمية وتعليم الكبار',
			},
			{
				name: 'مركز التدريب الإجتماعي',
			},
			{
				name: 'الهيئة الوطنية لشؤون المسنين',
			},
		],
	},
	{
		name: 'وزارة الإقتصاد والتجارة',
		children: [
			{
				name: 'المديريّة العامّة للإقتصاد والتجارة',
			},
			{
				name: 'المديريّة العامّة للحبوب والشمندر السكّري',
			},
			{
				name: 'مديرية حماية المستهلك',
			},
			{
				name: 'معرض رشيد كرامي – طرابلس',
			},
			{
				name: 'غرف التجارة والصناعة والزراعة',
			},
		],
	},
	{
		name: 'وزارة العمل',
		children: [
			{
				name: 'المديريّة العامّة لوزارة العمل',
			},
			{
				name: 'المؤسسة الوطنيّة للإستخدام',
			},
			{
				name: 'الصندوق الوطني للضمان الإجتماعي',
			},
		],
	},
	{
		name: 'وزارة الإعلام',
		children: [
			{
				name: 'المديريّة العامّة لوزارة الإعلام',
			},
			{
				name: 'مديرية الإذاعة',
			},
			{
				name: 'المجلس الوطني للإعلام',
			},
			{
				name: 'الوكالة الوطنيّة للإعلام',
			},
			{
				name: 'تلفزيون لبنان',
			},
		],
	},
	{
		name: 'وزارة الشباب والرياضة',
		children: [
			{
				name: 'المديريّة العامّة للشباب والرياضة',
			},
			{
				name: 'مصلحة المدينة الرياضيّة - المؤسسة العامة للمنشآت الرياضية والكشفية والشبابية',
			},
		],
	},
	{
		name: 'وزارة الدفاع الوطني',
		children: [
			{
				name: 'المديريّة العامّة لوزارة الدفاع',
			},
			{
				name: 'قيادة الجيش اللبناني',
			},
		],
	},
	{
		name: 'وزارة البيئة',
		children: [
			{
				name: 'المديريّة العامّة لوزارة البيئة',
			},
		],
	},
	{
		name: 'وزارة المهجرّين',
		children: [
			{
				name: 'وزارة المهجرّين - الجهاز التنفيذي',
			},
		],
	},
	{
		name: 'مكتب وزير الدولة لشؤون التنمية الإداريّة',
	},
];

function TabPanel(props) {
	const { children, value, index } = props;
	return (
		value === index && (
			<Grid item xs={12}>
				{children}
			</Grid>
		)
	);
}
export default function Intro() {
	const { t } = useTranslation();
	const [value, setValue] = useState(0);

	const handleChange = (event, newValue) => {
		setValue(newValue);
	};
	return (
		<Grid container spacing={2}>
			<Grid item xs={12}>
				<Card>
					<CardContent>
						<Typography variant="h5" align="center">
							{t('intro.title')}
						</Typography>
					</CardContent>
				</Card>
			</Grid>

			<Grid item xs={12}>
				<Card variant="outlined">
					<Tabs variant="fullWidth" indicatorColor="primary" value={value} onChange={handleChange}>
						<Tab icon={<AppsOutlinedIcon />} label={t('intro.section.one')} value={0} />

						<Tab icon={<ReorderOutlinedIcon />} label={t('intro.section.two')} value={1} />

						<Tab icon={<AccountTreeIcon />} label={t('intro.section.three')} value={2} />
					</Tabs>
				</Card>
			</Grid>
			<TabPanel value={value} index={0}>
				<GridView data={data} />
			</TabPanel>
			<TabPanel value={value} index={1}>
				<ChartView title={t('intro.title')} data={data} />
			</TabPanel>

			<TabPanel value={value} index={2}>
				<Index data={data} />
			</TabPanel>
		</Grid>
	);
}
