import * as React from 'react';
import TreeView from '@mui/lab/TreeView';
import SvgIcon from '@material-ui/core/SvgIcon';

import TreeItem from '@mui/lab/TreeItem';
import { Card, CardContent, Grid, Typography } from '@material-ui/core';

const data = {
	id: '1',
	name: 'إدارات الدولة اللبنانية',
	children: [
		{
			id: '2',
			name: 'رئاسة الجمهوريّة',
			children: [
				{
					name: 'الأمانة العامة لرئاسة الجمهورية',
				},
			],
		},
		{
			id: '3',
			name: 'المجلس النيابي',
			children: [{ name: 'الأمانة العامة لرئاسة المجلس النيابي' }],
		},
		{
			id: '4',
			name: 'رئاسة الحكومة',
			children: [
				{
					name: 'الأمانة العامة لرئاسة الحكومة',
				},
				{
					name: 'مجلس الجنوب',
				},
				{
					id: '28',
					name: 'مجلس الإنماء والإعمار',
					children: [
						{
							name: 'صندوق التنمية الإقتصادية والاجتماعيّة',
						},
					],
				},
				{
					id: '29',
					name: 'المجلس الوطني للبحوث العلميّة',
					children: [
						{
							name: 'المركز الوطني للبحوث الجيوفيزيائيّة',
						},
						{
							name: 'الهيئة العليا للطاقة الذريّة',
						},
						{
							name: 'المركز الوطني لعلوم البحار',
						},
						{
							name: 'المركز الوطني للإستشعار عن بعد',
						},
					],
				},
				{
					name: 'المجلس الوطني للسلامة المروريّة',
				},
				{
					name: 'المجلس الإقتصادي والاجتماعي',
				},
				{
					name: 'المجلس الأعلى للخصخصة',
				},
				{
					name: 'المجلس الأعلى للدفاع',
				},
				{
					name: 'المؤسسة العامّة لتشجيع الاستثمارات',
				},
				{
					name: 'المؤسسة العامّة لترتيب منطقة الضاحية الجنوبيّة (أليسار)',
				},
				{
					name: 'مؤسسة المحفوظات الوطنيّة',
				},
				{
					name: 'المؤسسة العامّة للأسواق الاستهلاكيّة',
				},
				{
					name: 'الهيئة العليا للإغاثة',
				},
				{
					name: 'الهيئة الوطنية لشؤون المرأة اللبنانيّة',
				},
				{
					name: 'الهيئة العامّة للمنطقة الاقتصادية الخاصّة في طرابلس',
				},
				{
					name: 'الصندوق الوطني للمهجرين',
				},
				{
					name: 'الإحصاء المركزي',
				},
				{
					name: 'المديريّة العامّة لأمن الدولة',
				},
				{
					name: 'الإفتاء السني',
				},
				{
					name: 'الإفتاء الجعفري',
				},
				{
					name: 'المجلس الإسلامي الشيعي الأعلى',
				},
				{
					name: 'المجلس الإسلامي العلوي',
				},
				{
					name: 'المجلس المذهبي لطائفة الموحدين الدروز',
				},
				{
					name: 'مشيخة عقل الطائفة الدرزيّة',
				},
				{
					id: '30',
					name: 'التفتيش المركزي',
					children: [
						{
							name: 'إدارة المناقصات',
						},
					],
				},
				{
					name: 'الهيئة العليا للتأديب',
				},
				{
					name: 'ديوان المحاسبة',
				},
				{
					id: '31',
					name: 'مجلس الخدمة المدنيّة',
					children: [
						{
							name: 'المعهد الوطني للإدارة',
						},
						{
							name: 'إدارة الأبحاث والتوجيه',
						},
					],
				},
				{
					name: 'تعاونية موظفي الدولة - الادارة المركزية',
				},
			],
		},
		{
			id: '5',
			name: 'وزارة العدل',
			children: [
				{
					name: 'المديرية العامة لوزارة العدل',
				},
				{
					name: 'مجلس شورى الدولة',
				},
				{
					name: 'مجلس القضاء الأعلى',
				},
			],
		},
		{
			id: '6',
			name: 'المجلس الدستوري',
		},
		{
			id: '7',
			name: 'وزارة الماليّة',
			children: [
				{
					name: 'مديرية الماليّة العامّة',
				},
				{
					name: 'مديرية الواردات',
				},
				{
					name: 'مديرية الضريبة على القيمة المضافة',
				},
				{
					name: 'مديرية الصرفيات',
				},
				{
					name: 'مديرية الخزينة',
				},
				{
					name: 'مديرية الدين العام',
				},
				{
					name: 'مديرية الموازنة',
				},
				{
					name: ' مديرية المحاسبة العامّة',
				},
				{
					name: 'المديرية العامّة للشؤون العقاريّة',
				},
				{
					name: 'المديرية العامّة لليانصيب الوطني',
				},
				{
					name: 'المديريّة العامّة للجمارك',
				},
				{
					name: 'معهد باسل فليحان الاقتصادي والمالي',
				},
				{
					name: 'المؤسسة الوطنيّة لضمان الودائع',
				},
				{
					name: 'إدارة حصر التبغ والتنباك اللبنانيّة',
				},
				{
					id: '32',
					name: 'مصرف لبنان',
					children: [
						{
							name: 'هيئة الأسواق المالية',
						},
						{
							name: 'بورصة بيروت',
						},
						{
							name: 'كازينو لبنان',
						},
						{
							name: 'طيران الشرق الأوسط',
						},
						{
							name: 'شركة إنترا',
						},
					],
				},
			],
		},
		{
			id: '8',
			name: 'وزارة الداخليّة والبلديات',
			children: [
				{
					name: 'وزارة الداخليّة والبلديات - المديرية الإداريّة المشتركة',
				},
				{
					name: ' المديرية العامّة للإدارات والمجالس المحليّة',
				},
				{
					name: 'المديريّة العامّة للشؤون السياسية واللاجئين',
				},
				{
					name: 'المديريّة العامّة للأحوال الشخصيّة',
				},
				{
					name: 'المديريّة العامّة للدفاع المدني',
				},
				{
					name: 'هيئة ادارة السير والآليات والمركبات',
				},
				{
					name: 'المديريّة العامّة لقوى الأمن الداخلي',
				},
				{
					name: 'المديريّة العامّة لقوى الأمن العام',
				},
				{
					name: 'المديريّة المركزيّة لمكافحة المخدرات',
				},
				{
					name: 'جهاز أمن المطار',
				},
				{
					name: 'الشركة المشغّلة للمعاينة الميكانيكيّة',
				},
				{
					name: 'الشركة المشغّلة لعدادات الوقوف (parkmeter)',
				},
				{
					id: '33',
					name: 'المحافظات',
					children: [
						{
							name: 'محافظة جبل لبنان',
						},
						{
							name: 'محافظة بيروت',
						},
						{
							name: 'محافظة البقاع',
						},
						{
							name: 'محافظة الجنوب',
						},
						{
							name: 'محافظة الشمال',
						},
						{
							name: 'محافظة بعلبك - الهرمل',
						},
						{
							name: 'محافظة عكار',
						},
						{
							name: 'محافظة النبطية',
						},
					],
				},
			],
		},
		{
			id: '9',
			name: 'وزارة الخارجيّة',
			children: [
				{
					name: 'وزارة الخارجيّة - الأمانة العامة',
				},
				{
					name: 'مديرية الشؤون السياسية والقنصلية',
				},
			],
		},
		{
			id: '10',
			name: 'وزارة الأشغال العامّة والنقل',
			children: [
				{
					name: 'وزارة الأشغال العامّة والنقل - المديريّة الإداريّة المشتركة',
				},
				{
					name: 'المديريّة العامّة للنقل البري والبحري',
				},
				{
					name: 'المديريّة العامّة للطرق والمباني',
				},
				{
					name: 'المديريّة العامّة للطيران المدني',
				},
				{
					name: 'الشركة المشغّلة لمواقف السيّارات في مطار رفيق الحريري الدولي',
				},
				{
					name: 'المديريّة العامّة للتنظيم المدني',
				},
				{
					name: 'مصلحة سكك الحديد والنقل المشترك',
				},
				{
					name: 'إدارة واستثمار مرفأ بيروت',
				},
				{
					name: 'مصلحة استثمار مرفأ صور',
				},
				{
					name: 'مصلحة استثمار مرفأ صيدا',
				},
				{
					name: 'مصلحة استثمار مرفأ طرابلس',
				},
				{
					name: 'الشركة المشغّلة للسوق الحرّة (Duty Free)',
				},
			],
		},
		{
			id: '11',
			name: 'وزارة الطاقة والمياه',
			children: [
				{
					name: 'المديريّة العامّة للموارد المائيّة والكهربائيّة',
				},
				{
					name: ' المديريّة العامّة للإستثمار',
				},
				{
					name: 'المديريّة العامّة للنفط',
				},
				{
					name: 'مؤسسة كهرباء لبنان',
				},
				{
					name: 'مؤسسة كهرباء زحلة',
				},
				{
					name: 'مؤسسة مياه بيروت وجبل لبنان',
				},
				{
					name: 'مؤسسة مياه لبنان الشمالي',
				},
				{
					name: 'مؤسسة مياه لبنان الجنوبي',
				},
				{
					name: 'مؤسسة مياه البقاع',
				},
				{
					name: 'المصلحة الوطنيّة لنهر الليطاني',
				},
				{
					name: 'هيئة إدارة قطاع البترول',
				},
			],
		},
		{
			id: '12',
			name: ' وزارة التربيّة والتعليم العالي',
			children: [
				{
					name: 'المديريّة العامّة للتربية',
				},
				{
					name: 'مديرية التعليم الأساسي',
				},
				{
					name: 'مديرية التعليم الثانوي',
				},
				{
					name: 'المديريّة العامّة للتعليم العالي',
				},
				{
					name: 'المديريّة العامّة للتعليم المهني والتقني',
				},
				{
					name: 'الجامعة اللبنانيّة',
				},
				{
					name: 'المركز التربوي للبحوث والإنماء',
				},
			],
		},
		{
			id: '13',
			name: 'وزارة الصحة',
			children: [
				{
					name: 'مديرية الصحّة العامّة',
				},
				{
					name: 'مديرية العناية الطبيّة',
				},
				{
					name: 'مديرية الوقاية الصحيّة',
				},
				{
					name: 'مديرية المختبر المركزي للصحة العامّة',
				},
				{
					id: '34',
					name: 'المستشفيات الحكوميّة',
					children: [
						{
							name: 'مستشفى رفيق الحريري',
						},
						{
							name: 'مستشفى بعبدا الجامعي الحكومي',
						},
						{
							name: 'مستشفى بعلبك الحكومي',
						},
						{
							name: 'مستشفى بشري الحكومي',
						},
						{
							name: 'مستشفى بنت جبيل الحكومي',
						},
						{
							name: 'مستشفى ضهر الباشق الحكومي الجامعي',
						},
						{
							name: 'مستشفى الدكتور عبدالله الراسي الحكومي',
						},
						{
							name: 'مستشفى اهدن الحكومي',
						},
						{
							name: 'مستشفى فتوح كسروان الحكومي',
						},
						{
							name: 'مستشفى بيروت الحكومي - الكرنتينا',
						},
						{
							name: 'مستشفى حاصبيا الحكومي',
						},
						{
							name: '  مستشفى الهرمل الحكومي',
						},
						{
							name: 'مستشفى جزين الحكومي',
						},
						{
							name: 'مستشفى قانا',
						},
						{
							name: 'مستشفى قرطبا الحكومي',
						},
						{
							name: 'مستشفى مرجعيون الحكومي',
						},
						{
							name: 'مستشفى ميس الجبل الحكومي',
						},
						{
							name: 'مستشفى النبطية الحكومي',
						},
						{
							name: 'مستشفى اورانج ناسو الحكومي',
						},
						{
							name: 'مستشفى الرئيس الياس الهراوي الحكومي',
						},
						{
							name: 'مستشفى راشيا الحكومي',
						},
						{
							name: 'مستشفى صيدا الحكومي الجامعي',
						},
						{
							name: 'مستشفى سبلين الحكومي',
						},
						{
							name: 'مستشفى الشحار الغربي الحكومي',
						},
						{
							name: 'مستشفى سير الضنية الحكومي',
						},
						{
							name: 'مستشفى صور الحكومي',
						},
						{
							name: 'مستشفى تنورين الحكومي',
						},
						{
							name: 'مستشفى تبنين الحكومي',
						},
						{
							name: 'مستشفى طرابلس الحكومي',
						},
					],
				},
			],
		},
		{
			id: '14',
			name: 'وزارة الصناعة',
			children: [
				{
					name: 'المديريّة العامّة لوزارة الصناعة',
				},
				{
					name: 'مؤسسة المقاييس والمواصفات',
				},
				{
					name: 'معهد البحوث الصناعيّة',
				},
			],
		},
		{
			id: '15',
			name: 'وزارة الإتصالات',
			children: [
				{
					name: 'وزارة الإتصالات - المصلحة الإداريّة المشتركة',
				},
				{
					name: 'المديريّة العامّة للإستثمار والصيانة',
				},
				{
					name: 'المديريّة العامّة للإنشاء والتجهيز',
				},
				{
					name: 'المديريّة العامّة للبريد',
				},
				{
					name: 'هيئة أوجيرو',
				},
				{
					name: 'الهيئة المنظمة للإتصالات',
				},
				{
					name: 'شركة تاتش',
				},
				{
					name: 'شركة ألفا',
				},
			],
		},
		{
			id: '16',
			name: 'وزارة الثقافة',
			children: [
				{
					name: 'المديريّة العامّة للثقافة',
				},
				{
					name: 'المديريّة العامّة للآثار',
				},
				{
					name: 'المعهد الوطني العالي للموسيقى (الكونسرفاتوار)',
				},
				{
					name: 'قصر الأونيسكو',
				},
				{
					name: 'المتحف الوطني',
				},
				{
					name: 'المكتبة الوطنيّة – الصنائع',
				},
				{
					name: 'المكتبة الوطنيّة – بعقلين',
				},
			],
		},
		{
			id: '17',
			name: 'وزارة الزراعة',
			children: [
				{
					name: 'المديريّة العامّة لوزارة الزراعة',
				},
				{
					name: 'مديرية العامة للتعاونيات',
				},
				{
					name: 'مصلحة الأبحاث العلميّة الزراعيّة',
				},
				{
					name: 'المشروع الأخضر',
				},
			],
		},
		{
			id: '18',
			name: 'وزارة السياحة',
			children: [
				{
					name: 'المديريّة العامّة للشؤون السياحيّة',
				},
				{
					name: 'شركة ماباس (الشركة المالكة لحق استثمار مغارة جعيتا)',
				},
			],
		},
		{
			id: '19',
			name: 'وزارة الشؤون الاجتماعيّة',
			children: [
				{
					name: 'المديريّة العامّة للشؤون الاجتماعيّة',
				},
				{
					name: 'مديرية الخدمات',
				},
				{
					name: 'مديرية التنمية الاجتماعيّة',
				},
				{
					name: 'برنامج تأمين حقوق المعوقين',
				},
				{
					name: 'المجلس الأعلى للطفولة',
				},
				{
					name: 'المؤسسة العامّة للإسكان',
				},
				{
					name: 'اللجنة الوطنية لمحو الأمية وتعليم الكبار',
				},
				{
					name: 'مركز التدريب الإجتماعي',
				},
				{
					name: 'الهيئة الوطنية لشؤون المسنين',
				},
			],
		},
		{
			id: '20',
			name: 'وزارة الإقتصاد والتجارة',
			children: [
				{
					name: 'المديريّة العامّة للإقتصاد والتجارة',
				},
				{
					name: 'المديريّة العامّة للحبوب والشمندر السكّري',
				},
				{
					name: 'مديرية حماية المستهلك',
				},
				{
					name: 'معرض رشيد كرامي – طرابلس',
				},
				{
					name: 'غرف التجارة والصناعة والزراعة',
				},
			],
		},
		{
			id: '21',
			name: 'وزارة العمل',
			children: [
				{
					name: 'المديريّة العامّة لوزارة العمل',
				},
				{
					name: 'المؤسسة الوطنيّة للإستخدام',
				},
				{
					name: 'الصندوق الوطني للضمان الإجتماعي',
				},
			],
		},
		{
			id: '22',
			name: 'وزارة الإعلام',
			children: [
				{
					name: 'المديريّة العامّة لوزارة الإعلام',
				},
				{
					name: 'مديرية الإذاعة',
				},
				{
					name: 'المجلس الوطني للإعلام',
				},
				{
					name: 'الوكالة الوطنيّة للإعلام',
				},
				{
					name: 'تلفزيون لبنان',
				},
			],
		},
		{
			id: '23',
			name: 'وزارة الشباب والرياضة',
			children: [
				{
					name: 'المديريّة العامّة للشباب والرياضة',
				},
				{
					name: 'مصلحة المدينة الرياضيّة - المؤسسة العامة للمنشآت الرياضية والكشفية والشبابية',
				},
			],
		},
		{
			id: '24',
			name: 'وزارة الدفاع الوطني',
			children: [
				{
					name: 'المديريّة العامّة لوزارة الدفاع',
				},
				{
					name: 'قيادة الجيش اللبناني',
				},
			],
		},
		{
			id: '25',
			name: 'وزارة البيئة',
			children: [
				{
					name: 'المديريّة العامّة لوزارة البيئة',
				},
			],
		},
		{
			id: '26',
			name: 'وزارة المهجرّين',
			children: [
				{
					name: 'وزارة المهجرّين - الجهاز التنفيذي',
				},
			],
		},
		{
			id: '27',
			name: 'مكتب وزير الدولة لشؤون التنمية الإداريّة',
		},
	],
};

function MinusSquare(props) {
	return (
		<SvgIcon fontSize="inherit" style={{ width: 14, height: 14 }} {...props}>
			{/* tslint:disable-next-line: max-line-length */}
			<path d="M22.047 22.074v0 0-20.147 0h-20.12v0 20.147 0h20.12zM22.047 24h-20.12q-.803 0-1.365-.562t-.562-1.365v-20.147q0-.776.562-1.351t1.365-.575h20.147q.776 0 1.351.575t.575 1.351v20.147q0 .803-.575 1.365t-1.378.562v0zM17.873 11.023h-11.826q-.375 0-.669.281t-.294.682v0q0 .401.294 .682t.669.281h11.826q.375 0 .669-.281t.294-.682v0q0-.401-.294-.682t-.669-.281z" />
		</SvgIcon>
	);
}

function PlusSquare(props) {
	return (
		<SvgIcon fontSize="inherit" style={{ width: 14, height: 14 }} {...props}>
			{/* tslint:disable-next-line: max-line-length */}
			<path d="M22.047 22.074v0 0-20.147 0h-20.12v0 20.147 0h20.12zM22.047 24h-20.12q-.803 0-1.365-.562t-.562-1.365v-20.147q0-.776.562-1.351t1.365-.575h20.147q.776 0 1.351.575t.575 1.351v20.147q0 .803-.575 1.365t-1.378.562v0zM17.873 12.977h-4.923v4.896q0 .401-.281.682t-.682.281v0q-.375 0-.669-.281t-.294-.682v-4.896h-4.923q-.401 0-.682-.294t-.281-.669v0q0-.401.281-.682t.682-.281h4.923v-4.896q0-.401.294-.682t.669-.281v0q.401 0 .682.281t.281.682v4.896h4.923q.401 0 .682.281t.281.682v0q0 .375-.281.669t-.682.294z" />
		</SvgIcon>
	);
}

export default function MakeTree() {
	const renderTree = (nodes) => (
		<Card variant="outlined" style={{ borderColor: 'transparent', minWidth: '100%' }}>
			<CardContent>
				<TreeItem key={nodes.id} nodeId={nodes.id} label={<Typography>{nodes.name}</Typography>}>
					{Array.isArray(nodes.children) ? nodes.children.map((node) => renderTree(node)) : null}
				</TreeItem>
			</CardContent>
		</Card>
	);

	return (
		<>
			<TreeView
				aria-label="controlled"
				defaultCollapseIcon={<MinusSquare />}
				defaultExpanded={['root']}
				defaultExpandIcon={<PlusSquare />}
				sx={{ height: '100vh', flexGrow: 1, maxWidth: 400, overflowY: 'auto' }}
			>
				{renderTree(data)}
			</TreeView>
		</>
	);
}
